## Update, Alter, Join, Views

Queries are run against dvdrental tutorial database.

In [1]:
from sqlalchemy import create_engine

In [2]:
engine_str = "postgresql+psycopg2://docker:docker@0.0.0.0:25432/dvdrental"
engine = create_engine(engine_str)

In [3]:
%load_ext sql
%sql $engine.url

In [4]:
%%sql
SELECT tablename FROM pg_catalog.pg_tables
WHERE schemaname='public' AND tableowner='postgres';

 * postgresql+psycopg2://docker:***@0.0.0.0:25432/dvdrental
15 rows affected.

[('film_actor',),
 ('address',),
 ('city',),
 ('customer',),
 ('actor',),
 ('film_category',),
 ('inventory',),
 ('category',),
 ('country',),
 ('language',),
 ('rental',),
 ('payment',),
 ('staff',),
 ('store',),
 ('film',)]

reset for reruns

In [5]:
%%sql 
ALTER TABLE payment
DROP COLUMN IF EXISTS refund CASCADE;

 * postgresql+psycopg2://docker:***@0.0.0.0:25432/dvdrental
Done.

[]

In [6]:
%sql SELECT * FROM payment LIMIT 5;

 * postgresql+psycopg2://docker:***@0.0.0.0:25432/dvdrental
5 rows affected.

[(20007, 319, 2, 12424, Decimal('8.99'), datetime.datetime(2007, 3, 18, 8, 45, 23, 996577)),
 (17504, 341, 1, 1778, Decimal('1.99'), datetime.datetime(2007, 2, 16, 17, 23, 14, 996577)),
 (20010, 319, 2, 15396, Decimal('5.99'), datetime.datetime(2007, 3, 22, 21, 36, 23, 996577)),
 (17506, 341, 2, 2829, Decimal('2.99'), datetime.datetime(2007, 2, 19, 19, 39, 56, 996577)),
 (20016, 321, 1, 12033, Decimal('6.99'), datetime.datetime(2007, 3, 17, 18, 43, 0, 996577))]

Make a copy of the payment table using CREATE TABLE ... AS

In [7]:
%%sql 
CREATE TABLE IF NOT EXISTS payment_bk
AS
SELECT * FROM payment;

 * postgresql+psycopg2://docker:***@0.0.0.0:25432/dvdrental
Done.

[]

In [8]:
%sql SELECT * FROM payment_bk LIMIT 5;

 * postgresql+psycopg2://docker:***@0.0.0.0:25432/dvdrental
5 rows affected.

[(17503, 341, 2, 1520, Decimal('7.99'), datetime.datetime(2007, 2, 15, 22, 25, 46, 996577)),
 (17504, 341, 1, 1778, Decimal('1.99'), datetime.datetime(2007, 2, 16, 17, 23, 14, 996577)),
 (17505, 341, 1, 1849, Decimal('7.99'), datetime.datetime(2007, 2, 16, 22, 41, 45, 996577)),
 (17506, 341, 2, 2829, Decimal('2.99'), datetime.datetime(2007, 2, 19, 19, 39, 56, 996577)),
 (17507, 341, 2, 3130, Decimal('7.99'), datetime.datetime(2007, 2, 20, 17, 31, 48, 996577))]

Add a new refund column of type money to the payment table where

refund = 5% of rental payment if payment > $5

In [9]:
%%sql
    ALTER TABLE payment
    ADD COLUMN IF NOT EXISTS refund money DEFAULT 0;

    UPDATE payment
    SET refund = amount * 0.05
    WHERE amount > 5.00;

 * postgresql+psycopg2://docker:***@0.0.0.0:25432/dvdrental
Done.
3618 rows affected.

[]

In [10]:
%sql SELECT * FROM payment WHERE amount > 4.99 LIMIT 10;

 * postgresql+psycopg2://docker:***@0.0.0.0:25432/dvdrental
10 rows affected.

[(20007, 319, 2, 12424, Decimal('8.99'), datetime.datetime(2007, 3, 18, 8, 45, 23, 996577), '$0.45'),
 (20010, 319, 2, 15396, Decimal('5.99'), datetime.datetime(2007, 3, 22, 21, 36, 23, 996577), '$0.30'),
 (20016, 321, 1, 12033, Decimal('6.99'), datetime.datetime(2007, 3, 17, 18, 43, 0, 996577), '$0.35'),
 (20017, 321, 2, 12034, Decimal('7.99'), datetime.datetime(2007, 3, 17, 18, 43, 57, 996577), '$0.40'),
 (20019, 321, 2, 13623, Decimal('6.99'), datetime.datetime(2007, 3, 20, 5, 18, 12, 996577), '$0.35'),
 (20020, 321, 1, 15673, Decimal('6.99'), datetime.datetime(2007, 3, 23, 7, 41, 16, 996577), '$0.35'),
 (20021, 321, 2, 15888, Decimal('5.99'), datetime.datetime(2007, 3, 23, 15, 24, 40, 996577), '$0.30'),
 (20025, 322, 1, 13650, Decimal('9.99'), datetime.datetime(2007, 3, 20, 6, 17, 32, 996577), '$0.50'),
 (20028, 322, 2, 15703, Decimal('8.99'), datetime.datetime(2007, 3, 23, 8, 52, 14, 996577), '$0.45'),
 (20034, 323, 1, 13140, Decimal('5.99'), datetime.datetime(2007, 3, 19, 11, 4, 22, 996577), '$0.30')]

Create view with boolean is_refunded column indicating if refund is available

In [11]:
%%sql
    CREATE OR REPLACE VIEW payment_refunded AS
    SELECT *,
    CASE WHEN refund > '$0.00' THEN 'True' ELSE 'False' END as is_refunded
    FROM payment;

 * postgresql+psycopg2://docker:***@0.0.0.0:25432/dvdrental
Done.

[]

In [12]:
%sql SELECT * FROM payment_refunded WHERE refund > '$0.00' LIMIT 10;

 * postgresql+psycopg2://docker:***@0.0.0.0:25432/dvdrental
10 rows affected.

[(20007, 319, 2, 12424, Decimal('8.99'), datetime.datetime(2007, 3, 18, 8, 45, 23, 996577), '$0.45', 'True'),
 (20010, 319, 2, 15396, Decimal('5.99'), datetime.datetime(2007, 3, 22, 21, 36, 23, 996577), '$0.30', 'True'),
 (20016, 321, 1, 12033, Decimal('6.99'), datetime.datetime(2007, 3, 17, 18, 43, 0, 996577), '$0.35', 'True'),
 (20017, 321, 2, 12034, Decimal('7.99'), datetime.datetime(2007, 3, 17, 18, 43, 57, 996577), '$0.40', 'True'),
 (20019, 321, 2, 13623, Decimal('6.99'), datetime.datetime(2007, 3, 20, 5, 18, 12, 996577), '$0.35', 'True'),
 (20020, 321, 1, 15673, Decimal('6.99'), datetime.datetime(2007, 3, 23, 7, 41, 16, 996577), '$0.35', 'True'),
 (20021, 321, 2, 15888, Decimal('5.99'), datetime.datetime(2007, 3, 23, 15, 24, 40, 996577), '$0.30', 'True'),
 (20025, 322, 1, 13650, Decimal('9.99'), datetime.datetime(2007, 3, 20, 6, 17, 32, 996577), '$0.50', 'True'),
 (20028, 322, 2, 15703, Decimal('8.99'), datetime.datetime(2007, 3, 23, 8, 52, 14, 996577), '$0.45', 'True'),
 (20034, 323, 1, 13140, Decimal('5.99'), datetime.datetime(2007, 3, 19, 11, 4, 22, 996577), '$0.30', 'True')]

Use join to create a customer contact table

In [13]:
%%sql

SELECT customer_id, customer.first_name || ' ' || customer.last_name as customer_name, 
        address.address as address, city.city as city, 
        address.postal_code as zip_code,
        country.country as country
FROM
customer JOIN address on customer.address_id = address.address_id
         JOIN city on city.city_id = address.city_id
         JOIN country on country.country_id = city.country_id
LIMIT 10;

 * postgresql+psycopg2://docker:***@0.0.0.0:25432/dvdrental
10 rows affected.

[(1, 'Mary Smith', '1913 Hanoi Way', 'Sasebo', '35200', 'Japan'),
 (2, 'Patricia Johnson', '1121 Loja Avenue', 'San Bernardino', '17886', 'United States'),
 (3, 'Linda Williams', '692 Joliet Street', 'Athenai', '83579', 'Greece'),
 (4, 'Barbara Jones', '1566 Inegl Manor', 'Myingyan', '53561', 'Myanmar'),
 (5, 'Elizabeth Brown', '53 Idfu Parkway', 'Nantou', '42399', 'Taiwan'),
 (6, 'Jennifer Davis', '1795 Santiago de Compostela Way', 'Laredo', '18743', 'United States'),
 (7, 'Maria Miller', '900 Santiago de Compostela Parkway', 'Kragujevac', '93896', 'Yugoslavia'),
 (8, 'Susan Wilson', '478 Joliet Way', 'Hamilton', '77948', 'New Zealand'),
 (9, 'Margaret Moore', '613 Korolev Drive', 'Masqat', '45844', 'Oman'),
 (10, 'Dorothy Taylor', '1531 Sal Drive', 'Esfahan', '53628', 'Iran')]

10 Most valuable customers who spent most on rentals

In [14]:
%%sql
SELECT customer.customer_id, sum(payment.amount) as payment_total
-- SELECT rental.rental_id, customer.customer_id, payment.payment_id, payment.amount 
FROM rental JOIN customer on rental.customer_id = customer.customer_id JOIN payment on rental.rental_id = payment.rental_id
GROUP BY customer.customer_id
ORDER BY payment_total DESC
LIMIT 10;

 * postgresql+psycopg2://docker:***@0.0.0.0:25432/dvdrental
10 rows affected.

[(148, Decimal('211.55')),
 (526, Decimal('208.58')),
 (178, Decimal('194.61')),
 (137, Decimal('191.62')),
 (144, Decimal('189.60')),
 (459, Decimal('183.63')),
 (181, Decimal('167.67')),
 (410, Decimal('167.62')),
 (236, Decimal('166.61')),
 (403, Decimal('162.67'))]